In [17]:
import pandas as pd
from pandas import Series, DataFrame

### Series ###

In [2]:
datos = Series(['Juan', 'Pedro', 'Luis'])
datos

0     Juan
1    Pedro
2     Luis
dtype: object

In [3]:
datos1 = Series(['Juan', 'Pedro', 'Luis'], index = ['a', 'b', 'c'])
datos1

a     Juan
b    Pedro
c     Luis
dtype: object

In [4]:
datos1.values

array(['Juan', 'Pedro', 'Luis'], dtype=object)

In [5]:
datos1['a']

'Juan'

In [6]:
datos[0]

'Juan'

In [7]:
datos1['d'] = 'Ana'
datos1

a     Juan
b    Pedro
c     Luis
d      Ana
dtype: object

In [9]:
sData = {'Pedro' : 23,
         'Juan' : 31,
         'María' : 18}
sData

{'Pedro': 23, 'Juan': 31, 'María': 18}

In [11]:
data = Series(sData)
data

Pedro    23
Juan     31
María    18
dtype: int64

In [15]:
data.index

Index(['Pedro', 'Juan', 'María'], dtype='object')

In [18]:
data.values

array([23, 31, 18])

### Data Frame ###

In [20]:
dicc = {'Departamento' : ['Atlántico', 'Bolívar', 'Sucre'],
        'Año' : [2000, 2010, 2005],
        'Población' : [1.5, 3.0, 1.0]}
dicc

{'Departamento': ['Atlántico', 'Bolívar', 'Sucre'],
 'Año': [2000, 2010, 2005],
 'Población': [1.5, 3.0, 1.0]}

In [22]:
df = DataFrame(dicc)
df

  Departamento   Año  Población
0    Atlántico  2000        1.5
1      Bolívar  2010        3.0
2        Sucre  2005        1.0

In [24]:
df['area'] = [1200, 1100, 1000]
df

  Departamento   Año  Población  area
0    Atlántico  2000        1.5  1200
1      Bolívar  2010        3.0  1100
2        Sucre  2005        1.0  1000

In [25]:
del df['area']
df

  Departamento   Año  Población
0    Atlántico  2000        1.5
1      Bolívar  2010        3.0
2        Sucre  2005        1.0